src/Reports/ВзаиморасчетыПодробно.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ВзаиморасчетыПодробно</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУЕТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтрагентПлательщик</Name>
					<Comment>Контрагент плательщик</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗуба</Name>
					<Comment>Номер зуба(лечение)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Зубы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубнойТехник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КартаКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Comment>Документ оказания услуг, реализации товаров</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументАванса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/РежимРаботыСетиСтоматологий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РежимРаботыСетиСтоматологий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕдинаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обособленно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущество</Name>
					<Comment>Имущество организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
					<Comment>Ввод остатков</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносУчредителя</Name>
					<Comment>Взнос учредителя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОшибочнойОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВКассу</Name>
					<Comment>Для фин. операций. Отправка банком ден. средств в организацию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДивидендовУчредителю</Name>
					<Comment>ВыплатаДивидендовУчредителю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеСертификата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуСкладами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещенияМеждуСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСкладу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассы</Name>
					<Comment>Для фин. операций. Поступление фиксация поступления ден. средств в банк </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтЭквайера</Name>
					<Comment>Поступление от эквайера</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаНаличныхВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеРозничнойВыручкиИзОперационнойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаРозничнойВыручкиВКассуПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВОперационнуюКассу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Comment>Денежные средства на лицевом счете</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводыВПути</Name>
					<Comment>Для фин. операций передачи денег из организации в банк</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
					<Comment>Для СБП и ссылок на оплату</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Reports/ВзаиморасчетыПодробно/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Процедура, выполняет формирование отчета по информации клиента
//
Процедура ВывестиАктОбОказанныхУслугах(Контрагент, СтруктурнаяЕдиница, ТабличныйДокумент, НачалоПериода, КонецПериода) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверка, выбран ли клиент
	Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Не выбран клиент!'");
		Сообщение.Сообщить();
		Возврат;		
	КонецЕсли;
	
	// Проверка, выбрана ли СтруктурнаяЕдиница
	Если СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка() Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	Если не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	// Получение макета	
	Макет = Отчеты.ВзаиморасчетыПодробно.ПолучитьМакет("Макет");
	
	ЭтоСетьСтоматологий = (Константы.РежимРаботыСетиСтоматологий.Получить() = Перечисления.РежимРаботыСетиСтоматологий.ЕдинаяСеть);
	
	ЗапросОбщейИнформации = Новый Запрос;
	ЗапросОбщейИнформации.УстановитьПараметр("Клиент", Контрагент);
	ЗапросОбщейИнформации.УстановитьПараметр("ЭтоСеть", ЭтоСетьСтоматологий);
	ЗапросОбщейИнформации.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	ЗапросОбщейИнформации.УстановитьПараметр("НачалоПериода", НачалоПериода);
	ЗапросОбщейИнформации.УстановитьПараметр("КонецПериода", КонецПериода);
	
	ЗапросОбщейИнформации.Текст = ПолучитьЗапросОбщейИнформации();
	
	Пакеты = ЗапросОбщейИнформации.ВыполнитьПакет();
	ВыборкаПоДатам = Пакеты[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 	
	Остатки = Пакеты[1].Выбрать();
	
	Если Остатки.Следующий() ТОгда
		
		ОстатокНаНачало = Остатки.СуммаНачальныйОстаток;
		ОстатокНаКонец = Остатки.СуммаКонечныйОстаток;
	Иначе
		ОстатокНаНачало = 0;
		ОстатокНаКонец = 0;	
	КонецЕсли;
	
	//=============================================ВЫВОД ИСТОРИИ ВЫПОЛНЕННЫХ РАБОТ===============================================	
	Если ВыборкаПоДатам.Количество() > 0 Тогда
		ИтогоСуммаСкидки 	= 0;
		ИтогоСуммаСоСкидкой = 0;
		ИтогоОплачено 		= 0; 
		Область_Заголовок = Макет.ПолучитьОбласть("Заголовок");
		Если не ЗначениеЗаполнено(НачалоПериода) И не ЗначениеЗаполнено(КонецПериода) Тогда 
			Область_Заголовок.НайтиТекст("Взаиморасчеты за период с [НачалоПериода] по [КонецПериода]").Текст = "Взаиморасчеты за весь период";
		Иначе
			Область_Заголовок.Параметры.НачалоПериода = Формат(НачалоПериода, "ДФ=dd.MM.yyyy");
			Область_Заголовок.Параметры.КонецПериода = Формат(КонецПериода, "ДФ=dd.MM.yyyy");
		КонецЕсли;	
		
		Область_Заголовок.Параметры.Клиент = Контрагент;
		ТабличныйДокумент.Вывести(Область_Заголовок);
		Область_ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		Область_ШапкаТаблицы.Параметры.ДатаНомерЗуба = "Дата / № зуба";
		ТабличныйДокумент.Вывести(Область_ШапкаТаблицы);
		
		/// Выведем итоговую строку на начало периода.
		Область_ИтоговаяСтрока = Макет.ПолучитьОбласть("СтрокаГруппировкаИтоги");
		Если ОстатокНаНачало > 0 Тогда
			Область_ИтоговаяСтрока.Параметры.ДолгПередПациентом = ОстатокНаНачало;                         
			Область_ИтоговаяСтрока.Параметры.ВидДолга = "Долг перед пациентом на начало периода:";
		Иначе
			Область_ИтоговаяСтрока.Параметры.ДолгПациента = -ОстатокНаНачало;
			Область_ИтоговаяСтрока.Параметры.ВидДолга = "Долг пациента на начало периода:";
		КонецЕсли;
		ТабличныйДокумент.Вывести(Область_ИтоговаяСтрока);
		Область_СтрокаГруппировкаДолг = Макет.ПолучитьОбласть("СтрокаГруппировкаДолг");
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Клиент", Контрагент);
		Запрос.УстановитьПараметр("ЭтоСеть", ЭтоСетьСтоматологий);
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		ПредыдущаяДата = Дата(1,1,1);
		Пока ВыборкаПоДатам.Следующий() Цикл
			ДатаЗаписи = ?(ВыборкаПоДатам.Дата = NULL, Дата(1,1,1), ВыборкаПоДатам.Дата);
			
			Если НачалоДня(ПредыдущаяДата) < НачалоДня(ДатаЗаписи) И ПредыдущаяДата > Дата(1,1,1) Тогда
				ТабличныйДокумент.Вывести(Область_СтрокаГруппировкаДолг);
			КонецЕсли;
			
			Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ДатаЗаписи)); 
			Запрос.УстановитьПараметр("КонецПериода", КонецДня(ДатаЗаписи));  
			Запрос.Текст = ПолучитьОстатки();
			Остатки = Запрос.Выполнить().Выбрать();
			Если Остатки.Следующий() Тогда
				Остаток = Остатки.СуммаКонечныйОстаток;
			Иначе 
				Остаток = 0;
			КонецЕсли;
			Если Остаток > 0 Тогда
				ДолгНадпись = "Долг перед пациентом на " + Формат(ДатаЗаписи, "ДФ=dd.MM.yyyy") + ":";
				Область_СтрокаГруппировкаДолг.Параметры.ДолгПередПациентом =  Остаток;
				Область_СтрокаГруппировкаДолг.Параметры.ДолгПациента = "";
			ИначеЕсли  Остаток = 0 Тогда
				ДолгНадпись = "Долг пациента на "  + Формат(ДатаЗаписи, "ДФ=dd.MM.yyyy") + ":";
				Область_СтрокаГруппировкаДолг.Параметры.ДолгПациента =  0;
				Область_СтрокаГруппировкаДолг.Параметры.ДолгПередПациентом = "";
			Иначе
				ДолгНадпись = "Долг пациента на "  + Формат(ДатаЗаписи, "ДФ=dd.MM.yyyy") + ":";
				Область_СтрокаГруппировкаДолг.Параметры.ДолгПациента =  - Остаток;
				Область_СтрокаГруппировкаДолг.Параметры.ДолгПередПациентом = "";
			КонецЕсли;
			Область_СтрокаГруппировкаДолг.Параметры.ДолгНадпись = ДолгНадпись;
			сч = 1;
			Результат = ВыборкаПоДатам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Результат.Следующий() Цикл		
				Если ТипЗнч(Результат.ДокументПродажи) = Тип("ДокументСсылка.Прием") 
					И ЗначениеЗаполнено(Результат.ДокументПродажи.ПолисМедСтрахования) Тогда
					
					Область_СтрокаГруппировкаПоДокументуПоСтрах= Макет.ПолучитьОбласть("СтрокаГруппировкаПоДокументуПоСтрах");
					Область_СтрокаГруппировкаПоДокументуПоСтрах.Параметры.Документ = Результат.ДокументПродажи;
					Область_СтрокаГруппировкаПоДокументуПоСтрах.Параметры.СтраховойПолис = Результат.ДокументПродажи.ПолисМедСтрахования;
					Если НачалоДня(ПредыдущаяДата) < НачалоДня(ДатаЗаписи) Тогда
						Область_СтрокаГруппировкаПоДокументуПоСтрах.Область(1,1,1,12).ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1); 
						Если  сч = 1 Тогда
							Область_СтрокаГруппировкаПоДокументуПоСтрах.Параметры.Дата =  ДатаЗаписи;
						Иначе 
							Область_СтрокаГруппировкаПоДокументуПоСтрах.Параметры.Дата =  "";
						КонецЕсли;
						ПредыдущаяДата = ДатаЗаписи;
					КонецЕсли;
					ТабличныйДокумент.Вывести(Область_СтрокаГруппировкаПоДокументуПоСтрах);
				Иначе
					Область_СтрокаГруппировкаПоДокументу = Макет.ПолучитьОбласть("СтрокаГруппировкаПоДокументу");
					Область_СтрокаГруппировкаПоДокументу.Параметры.Документ = Результат.ДокументПродажи;
					Область_СтрокаГруппировкаПоДокументу.Параметры.СуммаСкидкиПриема 	= Результат.Скидка_Сумма;
					Область_СтрокаГруппировкаПоДокументу.Параметры.СуммаСоСкидкойПриема = Результат.СтоимостьСоСкидкой;
					Область_СтрокаГруппировкаПоДокументу.Параметры.Оплачено 			= Результат.Оплачено;
					Если НачалоДня(ПредыдущаяДата) < НачалоДня(ДатаЗаписи) Тогда
						Область_СтрокаГруппировкаПоДокументу.Область(1,1,1,12).ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1); 
						Если  сч = 1 Тогда
							Область_СтрокаГруппировкаПоДокументу.Параметры.Дата =  ДатаЗаписи;
						Иначе 
							Область_СтрокаГруппировкаПоДокументу.Параметры.Дата =  "";
						КонецЕсли;
						ПредыдущаяДата = ДатаЗаписи;
					КонецЕсли;
					ТабличныйДокумент.Вывести(Область_СтрокаГруппировкаПоДокументу);
				КонецЕсли;
				ИтогоСуммаСкидки 	= ИтогоСуммаСкидки + Результат.Скидка_Сумма;
				ИтогоСуммаСоСкидкой = ИтогоСуммаСоСкидкой + Результат.СтоимостьСоСкидкой;
				ИтогоОплачено 		= ИтогоОплачено + Результат.Оплачено;
				
				ВыборкаПоУслугам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПоУслугам.Следующий() Цикл
					Если не ЗначениеЗаполнено(ВыборкаПоУслугам.Услуга) Тогда
						Продолжить;
					КонецЕсли;
					Область_СтрокаУслуга = Макет.ПолучитьОбласть("СтрокаУслуга");
					Область_СтрокаУслуга.Параметры.Услуга 			= ВыборкаПоУслугам.Услуга;
					Область_СтрокаУслуга.Параметры.Количество 		= ВыборкаПоУслугам.Количество;
					Если ТипЗнч(Результат.ДокументПродажи) = Тип("ДокументСсылка.Прием") 
						И ЗначениеЗаполнено(Результат.ДокументПродажи.ПолисМедСтрахования) Тогда
						Область_СтрокаУслуга.Параметры.СуммаСкидки 		= 0;
						Область_СтрокаУслуга.Параметры.СуммаСоСкидкой 	= 0;
						Область_СтрокаУслуга.Параметры.Оплачено 	    = 0;
					Иначе
						Область_СтрокаУслуга.Параметры.СуммаСкидки 		= ВыборкаПоУслугам.Скидка_Сумма;
						Область_СтрокаУслуга.Параметры.СуммаСоСкидкой 	= ВыборкаПоУслугам.СтоимостьСоСкидкой;
						Область_СтрокаУслуга.Параметры.Оплачено 	    = ВыборкаПоУслугам.Оплачено;
					КонецЕсли;
					СтрокаЗубы = "";
					Если ТипЗнч(ВыборкаПоУслугам.Услуга) = Тип("СправочникСсылка.Номенклатура") И ВыборкаПоУслугам.Услуга.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
						ВыборкаПоЗубам = ВыборкаПоУслугам.Выбрать(ОбходРезультатаЗапроса.Прямой);
						
						Пока ВыборкаПоЗубам.Следующий() Цикл
							Если ПустаяСтрока(СтрокаЗубы) Тогда 
								СтрокаЗубы = СтрокаЗубы + ВыборкаПоЗубам.НомерЗуба;
							Иначе 
								СтрокаЗубы = СтрокаЗубы + ", " + ВыборкаПоЗубам.НомерЗуба;
							КонецЕсли;
						КонецЦикла;	
						
						Область_СтрокаУслуга.Параметры.НомерЗуба = СтрокаЗубы;
					КонецЕсли;				
					Область_СтрокаУслуга.Параметры.КодУслуги = ВыборкаПоУслугам.КодУслуги;
					ТабличныйДокумент.Вывести(Область_СтрокаУслуга);
				КонецЦикла;
				сч = сч + 1;
			КонецЦикла;
			// ТабличныйДокумент.Вывести(Область_СтрокаГруппировкаДолг);		
		КонецЦикла;	
		
		ТабличныйДокумент.Вывести(Область_СтрокаГруппировкаДолг);
		
		Область_ПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
		Область_ПодвалТаблицы.Параметры.ИтогоСуммаСкидки 	= Формат(ИтогоСуммаСкидки, "ЧДЦ=2; ЧРД=.; ЧН=");
		Область_ПодвалТаблицы.Параметры.ИтогоСоСкидкой 		= Формат(ИтогоСуммаСоСкидкой, "ЧДЦ=2; ЧРД=.; ЧН=");
		Область_ПодвалТаблицы.Параметры.ИтогоОплачено 		= Формат(ИтогоОплачено, "ЧДЦ=2; ЧРД=.; ЧН=");
		ТабличныйДокумент.Вывести(Область_ПодвалТаблицы);
		
		/// Выведем итоговую строку на конец периода.
		Область_ИтоговаяСтрока = Макет.ПолучитьОбласть("СтрокаГруппировкаИтоги");
		Если ОстатокНаКонец >0 Тогда
			Область_ИтоговаяСтрока.Параметры.ДолгПередПациентом = ОстатокНаКонец;
			Область_ИтоговаяСтрока.Параметры.ВидДолга = "Долг перед пациентом на конец периода:";  
		Иначе
			Область_ИтоговаяСтрока.Параметры.ДолгПациента = -ОстатокНаКонец;
			Область_ИтоговаяСтрока.Параметры.ВидДолга = "Долг пациента на конец периода:";
		КонецЕсли;
		ТабличныйДокумент.Вывести(Область_ИтоговаяСтрока);
	КонецЕсли;
	
	// Секция -------------------- "История операций" -------------------
	
	ЗапросИсторияОпераций = Новый Запрос;
	ЗапросИсторияОпераций.УстановитьПараметр("Клиент", Контрагент);
	ЗапросИсторияОпераций.УстановитьПараметр("ЭтоСеть", ЭтоСетьСтоматологий);
	ЗапросИсторияОпераций.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	ЗапросИсторияОпераций.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Если КонецПериода = Дата(1,1,1) ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) Тогда	
		ЗапросИсторияОпераций.УстановитьПараметр("КонецПериода", Дата(3999,1,1));
	Иначе
		ЗапросИсторияОпераций.УстановитьПараметр("КонецПериода", КонецПериода);	
	КонецЕсли;	
	
	ЗапросИсторияОпераций.Текст = ПолучитьЗапросИсторияОпераций();
	
	РезультатИсторияОпераций = ЗапросИсторияОпераций.Выполнить().Выбрать();
	
	Если РезультатИсторияОпераций.Количество() > 0 Тогда
		
		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаИсторияОпераций"));
		
		// Итог нач.
		ДолгИтог = 0;
		АвансИтог = 0;
		ЛсИтог = 0;
		
		ОбластьИтоги = Макет.ПолучитьОбласть("СтрокаИтоги");
		Если НачалоПериода <> Дата(1,1,1) И ЗначениеЗаполнено(НачалоПериода) Тогда
			
			ЗапросНачИтог = Новый Запрос;
			ЗапросНачИтог.УстановитьПараметр("Клиент", Контрагент);
			ЗапросНачИтог.УстановитьПараметр("ЭтоСеть", ЭтоСетьСтоматологий);
			ЗапросНачИтог.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
			ЗапросНачИтог.УстановитьПараметр("НачалоПериода", Дата(1,1,1));
			ЗапросНачИтог.УстановитьПараметр("КонецПериода", НачалоПериода-1);		
			
			ЗапросНачИтог.Текст = ПолучитьЗапросИсторияОпераций();
			
			РезультатНачИтог = ЗапросНачИтог.Выполнить().Выгрузить();
			ДолгИтог = РезультатНачИтог.Итог("Долг");
			АвансИтог = РезультатНачИтог.Итог("Аванс");
			ЛсИтог = РезультатНачИтог.Итог("ЛицевойСчет");
			
			ОбластьИтоги.Параметры.НаПериод = "На начало периода:";	
			ОбластьИтоги.Параметры.ДолгИтог = ДолгИтог; 
			ОбластьИтоги.Параметры.АвансИтог = АвансИтог;
			ОбластьИтоги.Параметры.ЛсИтог = ЛсИтог;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьИтоги);
		
		ОбластьСтрокаИстория = Макет.ПолучитьОбласть("СтрокаИсторяОпераций");
		Пока РезультатИсторияОпераций.Следующий() Цикл 
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаИстория.Параметры, РезультатИсторияОпераций);
			Если СокрЛП(РезультатИсторияОпераций.Операция) = "Наличные" Тогда
				ОбластьСтрокаИстория.Параметры.Операция = "Оплата наличными";		
			ИначеЕсли СокрЛП(РезультатИсторияОпераций.Операция) = "Платежная карта" Тогда
				ОбластьСтрокаИстория.Параметры.Операция = "Оплата платежной картой";	
			ИначеЕсли СокрЛП(РезультатИсторияОпераций.Операция) = "Лицевой счет" Тогда	
				
				Если ТипЗнч(РезультатИсторияОпераций.Регистратор) = Тип("ДокументСсылка.НарядЗаказ") 
					Или ТипЗнч(РезультатИсторияОпераций.Регистратор) = Тип("ДокументСсылка.Поступление") Тогда 
					
					ЕстьДокументОснованияВРасшифровке = ЗначениеЗаполнено(ОбластьСтрокаИстория.Параметры.Регистратор.ДокументОснование);
					
				ИначеЕсли ТипЗнч(РезультатИсторияОпераций.Регистратор) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда 
					
					ЕстьДокументОснованияВРасшифровке = ЗначениеЗаполнено(ОбластьСтрокаИстория.Параметры.Регистратор.ОснованиеВозврата);
					
				ИначеЕсли ТипЗнч(ОбластьСтрокаИстория.Параметры.Регистратор) = Тип("ДокументСсылка.СписаниеЗадолженности") Тогда
					ЕстьДокументОснованияВРасшифровке = ЗначениеЗаполнено(ОбластьСтрокаИстория.Параметры.Регистратор.РасшифрокаСписания[0].ДокументОснования);
					
				Иначе 
					
					Если ОбластьСтрокаИстория.Параметры.Регистратор.Метаданные().ТабличныеЧасти.Найти("РасшифровкаПлатежа") <> Неопределено Тогда 
						ЕстьДокументОснованияВРасшифровке = ЗначениеЗаполнено(ОбластьСтрокаИстория.Параметры.Регистратор.РасшифровкаПлатежа[0].ДокументОснования);	
					Иначе
						ЕстьДокументОснованияВРасшифровке = Ложь;
					КонецЕсли;
					
				КонецЕсли;	
				                                                                         	
				Если ТипЗнч(РезультатИсторияОпераций.Регистратор) = Тип("ДокументСсылка.ПеремещениеДенежныхСредств") Тогда
					
					ОбластьСтрокаИстория.Параметры.Операция = "Перемещение денежных средств";      
					
				ИначеЕсли РезультатИсторияОпераций.ЛицевойСчет <  0 И ЕстьДокументОснованияВРасшифровке = Ложь 
					И ТипЗнч(РезультатИсторияОпераций.Регистратор) = Тип("ДокументСсылка.СписаниеДенежныхСредств") 
					И РезультатИсторияОпераций.Регистратор.ВидОперации = Перечисления.ВидыОпераций.ВозвратСЛицевогоСчета Тогда					
					
					ОбластьСтрокаИстория.Параметры.Операция = "Возврат с лицевого счета";
					
				ИначеЕсли РезультатИсторияОпераций.ЛицевойСчет <  0 И ЕстьДокументОснованияВРасшифровке = Истина Тогда					
					
					ОбластьСтрокаИстория.Параметры.Операция = "Оплата с лицевого счета";
					
				КонецЕсли;
			КонецЕсли;  			
			
			ДолгИтог = ДолгИтог + РезультатИсторияОпераций.Долг;
			АвансИтог = АвансИтог + РезультатИсторияОпераций.Аванс;
			ЛсИтог = ЛсИтог + РезультатИсторияОпераций.ЛицевойСчет;
			
			ТабличныйДокумент.Вывести(ОбластьСтрокаИстория);
		КонецЦикла;
		
		// Итог кон.
		ОбластьИтоги = Макет.ПолучитьОбласть("СтрокаИтоги");
		ОбластьИтоги.Параметры.НаПериод = "На конец периода:";	
		ОбластьИтоги.Параметры.ДолгИтог = ДолгИтог; 
		ОбластьИтоги.Параметры.АвансИтог = АвансИтог;
		ОбластьИтоги.Параметры.ЛсИтог = ЛсИтог;		
		ТабличныйДокумент.Вывести(ОбластьИтоги);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Функция возвращает текст запроса
//
Функция ПолучитьЗапросОбщейИнформации()	
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиОбороты2.Дата КАК Дата,
	|	ПродажиОбороты2.ДокументПродажи КАК ДокументПродажи,
	|	ПродажиОбороты2.Услуга КАК Услуга,
	|	ПродажиОбороты2.Сотрудник КАК Сотрудник,
	|	ПродажиОбороты2.НомерЗуба КАК НомерЗуба,
	|	ПродажиОбороты2.КодУслуги КАК КодУслуги,
	|	СУММА(ПродажиОбороты2.Скидка_Сумма) КАК Скидка_Сумма,
	|	СУММА(ПродажиОбороты2.Количество) КАК Количество,
	|	СУММА(ПродажиОбороты2.СтоимостьБезСкидки) КАК СтоимостьБезСкидки,
	|	СУММА(ПродажиОбороты2.СтоимостьСоСкидкой) КАК СтоимостьСоСкидкой,
	|	0 КАК Оплачено,
	|	ПродажиОбороты2.ДатаСортировки КАК ДатаСортировки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПродажиОбороты.ДокументПродажи.Дата КАК Дата,
	|		ПродажиОбороты.ДокументПродажи КАК ДокументПродажи,
	|		ПродажиОбороты.Номенклатура КАК Услуга,
	|		ПродажиОбороты.ДокументПродажи.Сотрудник КАК Сотрудник,
	|		ПродажиОбороты.НомерЗуба КАК НомерЗуба,
	|		ПродажиОбороты.Номенклатура.Артикул КАК КодУслуги,
	|		ПродажиОбороты.СтоимостьБезСкидкиОборот - ПродажиОбороты.СтоимостьОборот КАК Скидка_Сумма,
	|		ПродажиОбороты.КоличествоОборот КАК Количество,
	|		ПродажиОбороты.СтоимостьБезСкидкиОборот КАК СтоимостьБезСкидки,
	|		ПродажиОбороты.СтоимостьОборот КАК СтоимостьСоСкидкой,
	|		ПродажиОбороты.ДокументПродажи.Дата КАК ДатаСортировки
	|	ИЗ
	|		РегистрНакопления.Продажи.Обороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				Авто,
	|				Контрагент = &Клиент
	|					И ВЫБОР
	|						КОГДА НЕ &ЭтоСеть
	|							ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК ПродажиОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НарядЗаказЗапасы.Ссылка.Дата,
	|		НарядЗаказЗапасы.Ссылка,
	|		НарядЗаказЗапасы.Номенклатура,
	|		НарядЗаказЗапасы.Ссылка.Сотрудник,
	|		НарядЗаказЗапасы.Зуб,
	|		НарядЗаказЗапасы.Номенклатура.Артикул,
	|		НарядЗаказЗапасы.КоличествоУпаковок * НарядЗаказЗапасы.ЦенаПродажи - НарядЗаказЗапасы.ВсегоПродажи,
	|		НарядЗаказЗапасы.КоличествоУпаковок,
	|		НарядЗаказЗапасы.КоличествоУпаковок * НарядЗаказЗапасы.ЦенаПродажи,
	|		НарядЗаказЗапасы.ВсегоПродажи,
	|		НарядЗаказЗапасы.Ссылка.Дата
	|	ИЗ
	|		Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы,
	|		Константа.НарядЗаказУвеличиваетЗадолженность КАК НарядЗаказУвеличиваетЗадолженность
	|	ГДЕ
	|		(НарядЗаказЗапасы.Ссылка.Лаборатория = &КЛиент
	|				ИЛИ НарядЗаказЗапасы.Ссылка.Контрагент = &КЛиент)
	|		И ВЫБОР
	|				КОГДА НЕ &ЭтоСеть
	|					ТОГДА НарядЗаказЗапасы.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		И НарядЗаказЗапасы.Ссылка.Проведен
	|		И НарядЗаказЗапасы.Ссылка.Дата >= &НачалоПериода
	|		И ВЫБОР
	|				КОГДА &КонецПериода <> ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА НарядЗаказЗапасы.Ссылка.Дата <= &КонецПериода
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		И ВЫБОР
	|				КОГДА НЕ НарядЗаказУвеличиваетЗадолженность.Значение
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК ПродажиОбороты2
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты2.ДокументПродажи,
	|	ПродажиОбороты2.Услуга,
	|	ПродажиОбороты2.Сотрудник,
	|	ПродажиОбороты2.НомерЗуба,
	|	ПродажиОбороты2.КодУслуги,
	|	ПродажиОбороты2.ДатаСортировки,
	|	ПродажиОбороты2.Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Дата,
	|	ВложенныйЗапрос.ТипДенежныхСредств,
	|	ВложенныйЗапрос.Регистратор,
	|	ВложенныйЗапрос.ВидОперации,
	|	NULL,
	|	NULL,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВложенныйЗапрос.Оплачено,
	|	ВложенныйЗапрос.ДатаСортировки
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОНЕЦПЕРИОДА(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ПериодСекунда, ДЕНЬ) КАК Дата,
	|		ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|		NULL КАК Поле1,
	|		ВЫБОР
	|			КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеДенежныхСредств
	|				ТОГДА ""Перемещение""
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков
	|						ТОГДА ""Ввод начальных остатков""
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаПриход = 0
	|								ТОГДА ""Возврат""
	|							ИНАЧЕ ""Оплата""
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ КАК ВидОперации,
	|		СУММА(ВЫБОР
	|				КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаПриход = 0
	|					ТОГДА -ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаРасход
	|				ИНАЧЕ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаПриход
	|			КОНЕЦ) КАК Оплачено,
	|		ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор КАК Регистратор,
	|		ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ПериодСекунда КАК ДатаСортировки
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				Авто,
	|				,
	|				Контрагент = &Клиент
	|					И ВЫБОР
	|						КОГДА НЕ &ЭтоСеть
	|							ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
	|	ГДЕ
	|		НЕ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.Прием
	|		И НЕ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.Реализация
	|		И НЕ ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.НарядЗаказ
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор.ТипДенежныхСредств,
	|		ВЫБОР
	|			КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПеремещениеДенежныхСредств
	|				ТОГДА ""Перемещение""
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков
	|						ТОГДА ""Ввод начальных остатков""
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаПриход = 0
	|								ТОГДА ""Возврат""
	|							ИНАЧЕ ""Оплата""
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ,
	|		ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор,
	|		КОНЕЦПЕРИОДА(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ПериодСекунда, ДЕНЬ),
	|		ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ПериодСекунда) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Дата,
	|	ВложенныйЗапрос.ТипДенежныхСредств,
	|	ВложенныйЗапрос.Регистратор,
	|	ВложенныйЗапрос.ВидОперации,
	|	ВложенныйЗапрос.Оплачено,
	|	ВложенныйЗапрос.ДатаСортировки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	ДатаСортировки,
	|	НомерЗуба УБЫВ
	|ИТОГИ
	|	СУММА(Скидка_Сумма),
	|	СУММА(Количество),
	|	СУММА(СтоимостьБезСкидки),
	|	СУММА(СтоимостьСоСкидкой),
	|	СУММА(Оплачено)
	|ПО
	|	Дата ПЕРИОДАМИ(ДЕНЬ, , ),
	|	ДокументПродажи,
	|	Услуга
	|;            
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Контрагент,
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Контрагент = &Клиент
	|				И ВЫБОР
	|					КОГДА НЕ &ЭтоСеть
	|						ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты";
	              
	Возврат ТекстЗапроса; 	
	
КонецФункции

Функция ПолучитьОстатки()
	
	ТекстЗапроса =  "ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Контрагент,
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Контрагент = &Клиент
	|				И ВЫБОР
	|					КОГДА НЕ &ЭтоСеть
	|						ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьЗапросИсторияОпераций()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВзаиморасчетыСКонтрагентами.Период КАК Период,
	               |	ВзаиморасчетыСКонтрагентами.Регистратор КАК Регистратор,
	               |	ВзаиморасчетыСКонтрагентами.Регистратор.ВидОперации КАК ВидОперации,
	               |	ВзаиморасчетыСКонтрагентами.ВидДвижения КАК ВидДвижения,
	               |	ВзаиморасчетыСКонтрагентами.ДокументРеализации КАК ДокументРеализации,
	               |	ВзаиморасчетыСКонтрагентами.Сумма КАК Сумма,
	               |	ВзаиморасчетыСКонтрагентами.ДокументАванса КАК ДокументАванса
	               |ПОМЕСТИТЬ ВременнаяВзаиморасчеты
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентами КАК ВзаиморасчетыСКонтрагентами
	               |ГДЕ
	               |	ВзаиморасчетыСКонтрагентами.Период >= &НачалоПериода
	               |	И ВзаиморасчетыСКонтрагентами.Период <= &КонецПериода
	               |	И ВзаиморасчетыСКонтрагентами.Контрагент = &Клиент
	               |	И ВЫБОР
	               |			КОГДА НЕ &ЭтоСеть
	               |				ТОГДА ВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Операции.Период КАК Период,
	               |	Операции.Регистратор КАК Регистратор,
	               |	Операции.Операция КАК Операция,
	               |	СУММА(Операции.Долг) КАК Долг,
	               |	СУММА(Операции.Аванс) КАК Аванс,
	               |	СУММА(Операции.ЛицевойСчет) КАК ЛицевойСчет
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВременнаяВзаиморасчеты.Период КАК Период,
	               |		ВременнаяВзаиморасчеты.Регистратор КАК Регистратор,
	               |		ВЫБОР
	               |			КОГДА ВременнаяВзаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |				ТОГДА ВЫБОР
	               |						КОГДА ТИПЗНАЧЕНИЯ(ВременнаяВзаиморасчеты.Регистратор) = ТИП(Документ.СписаниеЗадолженности)
	               |							ТОГДА ""Списание задолженности""
	               |						ИНАЧЕ ""Прием""
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ВременнаяВзаиморасчеты.Регистратор ССЫЛКА Документ.Прием
	               |						ТОГДА ""Зачет аванса""
	               |					ИНАЧЕ ВременнаяВзаиморасчеты.Регистратор.ТипДенежныхСредств
	               |				КОНЕЦ
	               |		КОНЕЦ КАК Операция,
	               |		ВЫБОР
	               |			КОГДА ВременнаяВзаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |				ТОГДА ВременнаяВзаиморасчеты.Сумма
	               |			ИНАЧЕ -1 * ВременнаяВзаиморасчеты.Сумма
	               |		КОНЕЦ КАК Долг,
	               |		0 КАК Аванс,
	               |		0 КАК ЛицевойСчет
	               |	ИЗ
	               |		ВременнаяВзаиморасчеты КАК ВременнаяВзаиморасчеты
	               |	ГДЕ
	               |		(ВременнаяВзаиморасчеты.ДокументРеализации ССЫЛКА Документ.Прием
	               |				ИЛИ ВременнаяВзаиморасчеты.ДокументРеализации ССЫЛКА Документ.Реализация)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВременнаяВзаиморасчеты.Период,
	               |		ВременнаяВзаиморасчеты.Регистратор,
	               |		ВЫБОР
	               |			КОГДА ВременнаяВзаиморасчеты.Регистратор ССЫЛКА Документ.Прием
	               |				ТОГДА ""Зачет аванса""
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ВременнаяВзаиморасчеты.Регистратор ССЫЛКА Документ.ПоступлениеДенежныхСредств
	               |							И ВременнаяВзаиморасчеты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтКлиента)
	               |							И ВременнаяВзаиморасчеты.ДокументАванса <> НЕОПРЕДЕЛЕНО
	               |						ТОГДА ""Аванс по плану лечения""
	               |					КОГДА ВременнаяВзаиморасчеты.Регистратор ССЫЛКА Документ.ПоступлениеДенежныхСредств
	               |							И ВременнаяВзаиморасчеты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтКлиента)
	               |							И ВременнаяВзаиморасчеты.ДокументАванса = НЕОПРЕДЕЛЕНО
	               |						ТОГДА ""Аванс""
	               |					КОГДА ВременнаяВзаиморасчеты.Регистратор ССЫЛКА Документ.СписаниеДенежныхСредств
	               |							И ВременнаяВзаиморасчеты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыКлиенту)
	               |							И ВременнаяВзаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |						ТОГДА ""Возврат аванса""
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ВременнаяВзаиморасчеты.Регистратор ССЫЛКА Документ.ПоступлениеДенежныхСредств
	               |									И ВременнаяВзаиморасчеты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВзносНаЛицевойСчет)
	               |								ТОГДА ""Зачисление на лицевой счет""
	               |							ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ЛицевойСчет)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ВременнаяВзаиморасчеты.Регистратор ССЫЛКА Документ.Прием
	               |				ТОГДА ВременнаяВзаиморасчеты.Сумма
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ВременнаяВзаиморасчеты.Регистратор ССЫЛКА Документ.ПоступлениеДенежныхСредств
	               |								И ВременнаяВзаиморасчеты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтКлиента)
	               |							ИЛИ ВременнаяВзаиморасчеты.Регистратор ССЫЛКА Документ.СписаниеДенежныхСредств
	               |								И ВременнаяВзаиморасчеты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыКлиенту)
	               |								И ВременнаяВзаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |						ТОГДА ВременнаяВзаиморасчеты.Сумма
	               |					ИНАЧЕ 0
	               |				КОНЕЦ
	               |		КОНЕЦ,
	               |		ВЫБОР
	               |			КОГДА ВременнаяВзаиморасчеты.Регистратор ССЫЛКА Документ.Прием
	               |				ТОГДА 0
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ВременнаяВзаиморасчеты.Регистратор ССЫЛКА Документ.ПоступлениеДенежныхСредств
	               |								И ВременнаяВзаиморасчеты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ОплатаОтКлиента)
	               |							ИЛИ ВременнаяВзаиморасчеты.Регистратор ССЫЛКА Документ.СписаниеДенежныхСредств
	               |								И ВременнаяВзаиморасчеты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратОплатыКлиенту)
	               |								И ВременнаяВзаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |						ТОГДА 0
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ВременнаяВзаиморасчеты.Регистратор ССЫЛКА Документ.СписаниеДенежныхСредств
	               |									И ВременнаяВзаиморасчеты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВозвратСЛицевогоСчета)
	               |								ТОГДА -1 * ВременнаяВзаиморасчеты.Сумма
	               |							ИНАЧЕ ВЫБОР
	               |									КОГДА ВременнаяВзаиморасчеты.Регистратор ССЫЛКА Документ.ПеремещениеДенежныхСредств
	               |											И ВременнаяВзаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |										ТОГДА -1 * ВременнаяВзаиморасчеты.Сумма
	               |									ИНАЧЕ ВременнаяВзаиморасчеты.Сумма
	               |								КОНЕЦ
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ
	               |	ИЗ
	               |		ВременнаяВзаиморасчеты КАК ВременнаяВзаиморасчеты
	               |	ГДЕ
	               |		НЕ ВременнаяВзаиморасчеты.ДокументРеализации ССЫЛКА Документ.Прием
	               |		И НЕ ВременнаяВзаиморасчеты.ДокументРеализации ССЫЛКА Документ.Реализация) КАК Операции
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Операции.Период,
	               |	Операции.Регистратор,
	               |	Операции.Операция
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Операции.Период,
	               |	Долг УБЫВ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти
